#ifndef AIR_DAMPING_H_INCLUDED
#define AIR_DAMPING_H_INCLUDED

#ifdef __cplusplus
extern "C"
{
#endif

#define XA_AIR_DENSITY 1.22 /// Плотность сухого воздуха над уровнем моря при нормальном давлении

/** \brief Получить силу сопротивления воздуха при отсутствии подъемной силы
 * \param vel скорость тела
 * \param vel_wind скорость ветра
 * \param Cxo безразмерный аэродинамический коэффициент сопротивления
 * Определение характерной площади зависит от формы тела:
 * в простейшем случае (шар) — площадь поперечного сечения
 * для крыльев и оперения — площадь крыла/оперения в плане
 * для пропеллеров и несущих винтов вертолётов — либо площадь лопастей, либо ометаемая площадь винта
 * для подводных объектов обтекаемой формы — площадь смачиваемой поверхности
 * для продолговатых тел вращения, ориентированных вдоль потока (фюзеляж, оболочка дирижабля) — приведённая волюметрическая площадь, равная V2/3, где V — объём тела
 * Примеры Cxo КСФ для некоторых форм:
 * Сфера 0.47
 * Конус 2:1 (острием к потоку) 0.5
 * Куб (поверхностью к потоку) 1.05
 * Цилиндр (длина равна двум диаметрам, торцом к потоку) 0.82
 * Вытянутое каплевидное тело 0,04
 * \param S характерной площадь
 * \param p плотность воздуха (1.22 при высоте 0м над уровнем моря)
 * \return сила сопротивления воздуха
 */
double xaGetAirResistanceForce(double vel, double vel_wind, double Cxo, double S, double p);

#ifdef __cplusplus
}
#endif

#endif // AIR_DAMPING_H_INCLUDED
